recept/src/Catalogs/НоменклатураМатериалы/НоменклатураМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураМатериалы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Продукция</name>
      <description>Продукция</description>
    </items>
    <items>
      <name>Сырье</name>
      <description>Сырье</description>
    </items>
  </predefined>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСырья</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </attributes>
  <attributes>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вязкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перетир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/InformationRegisters/ЦеныМатериалов/ЦеныМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМатериалов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/InformationRegisters/СтатусПродукции/СтатусПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусПродукции</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыГотовностиПродукции</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/AccumulationRegisters/ПотребностьМатериалов/ПотребностьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностьМатериалов</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Catalogs/НоменклатураМатериалы/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьМинимальныйОстаток(НоменклатураМатериалы) 
// Функция передает в процедуру реквизит минимальный остаток материала из справочника НоменклатураМатериалы

	Возврат НоменклатураМатериалы.МинимальныйОстаток; 
	                     	
КонецФункции

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивНаименований = Строки.ПолучитьКлючи();
	
	Если МассивНаименований.Количество() > 0 Тогда
		
		Если Строки[МассивНаименований[0]].Данные.Свойство("Остаток") Тогда
		    // Остатки выгружаем из регистра накоплений в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиМатериаловОстатки.Наименование КАК Наименование,
				|	ОстаткиМатериаловОстатки.ОстатокОстаток КАК ОстатокОстаток
				|ИЗ
				|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Наименование В (&МассивНаименований)) КАК ОстаткиМатериаловОстатки";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаСписка = Строки[Выборка.Наименование];
				СтрокаСписка.Данные["Остаток"] = Выборка.ОстатокОстаток;
				Если Выборка.ОстатокОстаток < ПолучитьМинимальныйОстаток(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Остаток"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный)
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
			
		Если Строки[МассивНаименований[0]].Данные.Свойство("Цена") Тогда
			// Цены выгружаем из регистра сведений в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныМатериаловСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.ЦеныМатериалов.СрезПоследних(, Номенклатура В (&МассивНаименований)) КАК ЦеныМатериаловСрезПоследних";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл

				СтрокаСписка = Строки[Выборка.Номенклатура];
				СтрокаСписка.Данные["Цена"] = Выборка.Цена;
				
			КонецЦикла; 
		КонецЕсли;	   
		
	Если Строки[МассивНаименований[0]].Данные.Свойство("Статус") Тогда  
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусПродукцииСрезПоследних.Номенклатура КАК Номенклатура,
			|	СтатусПродукцииСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусПродукции.СрезПоследних(, Номенклатура В (&МассивНаименований)) КАК СтатусПродукцииСрезПоследних";
		
		Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл
				СтрокаСписка = Строки[Выборка.Номенклатура];
				СтрокаСписка.Данные["Статус"] = Выборка.Статус;
			КонецЦикла;
	
	КонецЕсли;	

			
		Если Строки[МассивНаименований[0]].Данные.Свойство("Потребность") Тогда
			// Потребность из регистра выгружаем в список номенклатуры
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПотребностьМатериаловОстатки.Наименование КАК Наименование,
				|	ПотребностьМатериаловОстатки.ПотребностьОстаток КАК ПотребностьОстаток
				|ИЗ
				|	РегистрНакопления.ПотребностьМатериалов.Остатки(, Наименование В (&МассивНаименований)) КАК ПотребностьМатериаловОстатки";
			
			Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаСписка = Строки[Выборка.Наименование];
				СтрокаСписка.Данные["Потребность"] = Выборка.ПотребностьОстаток;
				Если Выборка.ПотребностьОстаток > РаботаСоСправочниками.ОстаткиМатериалов(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Потребность"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный)
				ИначеЕсли (Выборка.ПотребностьОстаток * 2) > РаботаСоСправочниками.ОстаткиМатериалов(Выборка.Наименование) Тогда
					СтрокаСписка.Оформление["Потребность"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Оранжевый)
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПустыеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
